# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# FeatherDet: a clean rebuild for VisDrone small-object benchmarking.
# Project charter:
# 1) lighter than YOLO26n at inference,
# 2) stronger on tiny-person-heavy aerial scenes,
# 3) novelty comes from a detail-preserving stem + micro-aware fusion + area-aware training loss.

nc: 80
end2end: False
reg_max: 8

# Train-time only weighting for small assigned boxes.
area_focus: True
area_gain: 1.0
area_gamma: 0.5
area_ref: 0.02
area_min: 1.0
area_max: 3.0

backbone:
  # [from, repeats, module, args]
  - [-1, 1, DPSStem, [24]] # 0-P1/2
  - [-1, 1, Conv, [48, 3, 2]] # 1-P2/4
  - [-1, 2, MAFBlock, [48, 0.5]] # 2
  - [-1, 1, SCDown, [96, 3, 2]] # 3-P3/8
  - [-1, 2, MAFBlock, [96, 0.5]] # 4
  # Deep stage is intentionally trimmed because VisDrone benefits more from preserving P2/P3 detail
  # than from a wide P4 branch. This keeps the charter aligned with "lighter than YOLO26n".
  - [-1, 1, SCDown, [144, 3, 2]] # 5-P4/16
  - [-1, 1, MAFBlock, [144, 0.5]] # 6
  - [-1, 1, SPPF, [144, 5]] # 7
  - [-1, 1, MAFBlock, [144, 0.5]] # 8

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 1, MAFBlock, [96, 0.5]] # 11

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 2], 1, Concat, [1]]
  - [-1, 2, MAFBlock, [48, 0.5]] # 14 (P2/4)

  - [-1, 1, SCDown, [96, 3, 2]]
  - [[-1, 11], 1, Concat, [1]]
  - [-1, 1, MAFBlock, [96, 0.5]] # 17 (P3/8)

  - [-1, 1, SCDown, [144, 3, 2]]
  - [[-1, 8], 1, Concat, [1]]
  - [-1, 1, MAFBlock, [144, 0.5]] # 20 (P4/16)

  - [[14, 17, 20], 1, Detect, [nc]] # Detect(P2, P3, P4)
