# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLO26-Nova: lightweight and novelty-oriented variant for research ablations
# Key changes:
# 1) C3k2 -> C3SREB
# 2) C2PSA -> C2PSALite
# 3) SparseRouterNeck on top of P3/P4/P5 features
# 4) U-DAS-style criterion enabled by `udas: True`

nc: 80
end2end: True
reg_max: 1
udas: True
nova_distill: 0.12
nova_distill_warmup: 12
nova_uncertainty_thresh: 0.35
nova_distill_temp: 2.0
nova_sparse_weight: 0.0005
nova_sparse_warmup: 8

scales:
  # [depth, width, max_channels]
  n: [0.50, 0.23, 1024]
  s: [0.50, 0.46, 1024]
  m: [0.50, 0.90, 512]
  l: [1.00, 0.95, 512]
  x: [1.00, 1.40, 512]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3SREB, [256, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3SREB, [512, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3SREB, [512, 0.50]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3SREB, [1024, 0.50]]
  - [-1, 1, SPPF, [1024, 5, 3, True]] # 9
  - [-1, 2, C2PSALite, [1024]]

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 2, C3SREB, [512, 0.50]] # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 2, C3SREB, [256, 0.50]] # 16 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]
  - [-1, 2, C3SREB, [512, 0.50]] # 19 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]
  - [-1, 1, C3SREB, [1024, 0.50]] # 22 (P5/32-large)

  # Sparse router and dynamic extraction
  - [[16, 19, 22], 1, SparseRouterNeck, []] # 23
  - [23, 1, Index, [0]] # 24 -> routed P3
  - [23, 1, Index, [1]] # 25 -> routed P4
  - [23, 1, Index, [2]] # 26 -> routed P5

  - [[24, 25, 26], 1, Detect, [nc]] # 27 Detect(P3, P4, P5)

