# Draft architecture for YOLO26-Nova (research prototype)
# Custom modules: C3SREB, SparseRouterNeck, C2PSALite (to be registered in Ultralytics parser)

nc: 80
end2end: True
reg_max: 1

scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 2, C3SREB, [256, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 2, C3SREB, [512, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 2, C3SREB, [512, 0.50]]
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 2, C3SREB, [1024, 0.50]]
  - [-1, 1, SPPF, [1024, 5, 3, True]]
  - [-1, 2, C2PSALite, [1024]]

head:
  # replace dense PAN-style fixed fusion with learnable sparse routing
  - [[4, 6, 10], 1, SparseRouterNeck, [256, 512, 1024]]

  # unpack routed features and keep standard detect head
  - [0, 1, Identity, []]  # P3
  - [1, 1, Identity, []]  # P4
  - [2, 1, Identity, []]  # P5
  - [[12, 13, 14], 1, Detect, [nc]]

